bubble_column/Allrun
#!/bin/sh


blockMesh
rm -rf 0
cp -r 0_org 0
setFields
interFoam

#------------------------------------------------------------------------------
