bubble_column/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0   0   0)
    (0.1 0   0)
    (0.1 0.1 0)
    (0 0.1   0)
    (0   0   0.01)
    (0.1 0   0.01)
    (0.1 0.1 0.01)
    (0 0.1   0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            
            (1 5 4 0)
        );
    }
    left
    {
        type            cyclic;
        neighbourPatch  right;
        faces
        (
            (0 4 7 3)
            
        );
    }
    right
    {
        type            cyclic;
        neighbourPatch  left;
        faces
        (     
            (2 6 5 1)
            
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
